# Pandas( Series and DataFrame )

## 1) Pandas Series

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,True,False])

0        1
1        2
2        3
3        4
4     True
5    False
dtype: object

### Indexing series

In [3]:
a=pd.Series([1,2,3,4,True,False],dtype='int32',index=['a','b','c','d','e','f'])
print(a)

a    1
b    2
c    3
d    4
e    1
f    0
dtype: int32

In [4]:
print(a['b'])

2

In [5]:
b=pd.Series([1,2,3,4.5])
print(b)

0    1.0
1    2.0
2    3.0
3    4.5
dtype: float64

### # Dictionary Series

In [6]:
d={"name":"sachin","roll":12,"age":25}
pd.Series(d)

name    sachin
roll        12
age         25
dtype: object

### # Single element multiple index

In [7]:
e=pd.Series(1,index=[1,2,3,4,5,6])
print(e)

1    1
2    1
3    1
4    1
5    1
6    1
dtype: int64

## 2) Pandas Dataframe

In [22]:
mydataset={
    'cars':["BMW","Volvo","Ford"],
    'passings':[3,7,2]
}
myvar=pd.DataFrame(mydataset)
print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

### Locate row

In [26]:
myvar.loc[[0,1]]

    cars  passings
0    BMW         3
1  Volvo         7

In [8]:
name=pd.Series(["Dev","Indra","Bakhati"])
salary=pd.Series([1000,2000,3000])

In [9]:
df=pd.DataFrame({"Name":name,"Salary":salary})
print(df)

      Name  Salary
0      Dev    1000
1    Indra    2000
2  Bakhati    3000

### i)Shape

In [10]:
df.shape

(3, 2)

### ii)Size

In [11]:
df.size

6

### iii)Index

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
df["Name"]

0        Dev
1      Indra
2    Bakhati
Name: Name, dtype: object

In [14]:
df[["Name"]]

      Name
0      Dev
1    Indra
2  Bakhati

In [15]:
df["Salary"]

0    1000
1    2000
2    3000
Name: Salary, dtype: int64

In [16]:
df[["Salary"]]

   Salary
0    1000
1    2000
2    3000

In [17]:
df[["Name","Salary"]]

      Name  Salary
0      Dev    1000
1    Indra    2000
2  Bakhati    3000

### iv)Copy Dataframe

In [18]:
df2=df[["Name"]].copy()

In [19]:
print(df2)

      Name
0      Dev
1    Indra
2  Bakhati

### v)Slicing

In [20]:
df[1:3]

      Name  Salary
1    Indra    2000
2  Bakhati    3000